src/posts/java-learn-springboot/index.org
* SpringBoot 项目打包运行

1. 引入打包插件

      #+begin_src xml
        <build>
          <plugins>
            <plugin>
              <groupId>org.springframework.boot</groupId>
              <artifactId>spring-boot-maven-plugin</artifactId>
            </plugin>
          </plugins>
        </build>
      #+end_src

2. 执行打包命令

      #+begin_src shell
        mvn package
      #+end_src

打包成功后可以在 =target= 目录下找到生成的 JAR 包文件

3. 运行 JAR 包

#+begin_src shell
  java -jar my-application.jar
  # 覆盖配置文件中的参数
  java -jar my-application.jar --spring.profiles.active=dev --server.port=8080
#+end_src

* main 方法中的 =String[] args= 参数

#+begin_src java
  public static void main(String[] args) {
      System.out.println(Arrays.toString(args));
      SpringApplication.run(MyApplication.class, args);
  }
#+end_src

当执行 =java -jar my-application --spring.profiles.active=dev --server.port=8080= 时，
将看到 args 的输出内容为 ["--spring.profiles.active=dev", "--server.port=8080"].

所以，也可以自己在 main 方法中构造好参数，传入 SpringApplication.run() 方法。例如

#+begin_src java
  public static void main(String[] args) {
      String[] arg = new String[1];
      arg[0] = "--spring.profiles.active=prod";
      SpringApplication.run(MyApplication.class, arg);
  }
#+end_src

* SpringBoot 中配置文件的优先级

从上至下优先级越来越高。
同级别的路径中 properties 配置文件的优先级比 yml 配置文件的优先级高。

1. classpath 中的 application.yml
2. classpath 中的 config/application.yml
3. 当前工作目录中的 application.yml
4. 当前工作目录中的 config/application.yml

注意：当前工作目录是指执行 java 命令时所处的目录。

* SpringBoot 多环境配置

** 在同一个 yml 配置文件中配置不同的环境

#+begin_src yaml
  spring:
    profiles:
      active: dev

  ---
  spring:
    profiles: dev

  server:
    port: 8081

  ---
  spring:
    profiles: test

  server:
    port: 8082

  ---
  spring:
    profiles: prod

  server:
    port: 8083
#+end_src

可以看到配置文件中默认激活的是 =dev= 环境，
可以打包后执行 =java -jar my-application.jar --spring.profiles.active=prod= 指定激活的环境.

注意： =spring.profiles=dev= 被标记为已废弃的方式，
现在推荐使用 =spring.config.activete.on-profile=dev= 这种方式.

** 使用不同的文件配置多个环境

1. =application.yml= 公共配置
2. =application-dev.yml= 开发环境配置
3. =application-test.yml= 测试环境配置
4. =application-prod.yml= 生产环境配置

** 使用 =spring.profiles.include= 包含其他配置文件

比如，将数据库，缓存，消息队列等配置放置在不同的配置文件中，在主配置文件中使用 =include= 加载这些配置。

假设有如下配置文件:
#+begin_example
  application-db.yml
  application-kafka.yml
  application-redis.yml
#+end_example

主配置文件中可以这样配置:
#+begin_src yaml
  spring:
    profiles:
      include: db,kafka,redis
#+end_src

启动应用后可以看到如下输出:
#+begin_example
  The following 3 profiles are active: "db", "kafka", "redis"
#+end_example

如果有相同的配置， 优先级顺序也是左边(db)优先级低， 右边(redis)优先级高。主配置文件中配置优先级是最低的。

注意： =include= 的配置文件是不包含文件名中 =application-= 前缀的。如果写错了，启动时也是不会报错的，可能不容易发现。

** 使用 =spring.profiles.group= 对配置文件分组

主配置文件中配置内容如下：
#+begin_src yaml
  spring:
    profiles:
      active: prod
      group:
        dev: db,redis
        prod: db,kafka
#+end_src

启动时可以看到如下输出:
#+begin_example
  The following 3 profiles are active: "prod", "db", "kafka"
#+end_example

同样，如果有相同配置时，由左至右优先级越来越高。

