posts/java-learn-springboot/index.html

<section id="outline-container-org694a4df" class="outline-2">
<h2 id="org694a4df">SpringBoot 项目打包运行</h2>
<div class="outline-text-2" id="text-org694a4df">
<ol class="org-ol">
<li><p>
引入打包插件
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">build</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">plugins</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">plugin</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">org.springframework.boot</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">spring-boot-maven-plugin</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">plugin</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">plugins</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">build</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div></li>

<li><p>
执行打包命令
</p>

<div class="org-src-container">
<pre class="src src-shell">mvn package
</pre>
</div></li>
</ol>

<p>
打包成功后可以在 <code>target</code> 目录下找到生成的 JAR 包文件
</p>

<ol class="org-ol">
<li>运行 JAR 包</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell">java -jar my-application.jar
<span class="org-comment-delimiter"># </span><span class="org-comment">&#35206;&#30422;&#37197;&#32622;&#25991;&#20214;&#20013;&#30340;&#21442;&#25968;</span>
java -jar my-application.jar --spring.profiles.active=dev --server.port=8080
</pre>
</div>
</div>
</section>

<section id="outline-container-org231a180" class="outline-2">
<h2 id="org231a180">main 方法中的 <code>String[] args</code> 参数</h2>
<div class="outline-text-2" id="text-org231a180">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    System.out.println(Arrays.toString(args));
    SpringApplication.run(MyApplication.<span class="org-keyword">class</span>, args);
}
</pre>
</div>

<p>
当执行 <code>java -jar my-application --spring.profiles.active=dev --server.port=8080</code> 时，
将看到 args 的输出内容为 [&ldquo;&#x2013;spring.profiles.active=dev&rdquo;, &ldquo;&#x2013;server.port=8080&rdquo;].
</p>

<p>
所以，也可以自己在 main 方法中构造好参数，传入 SpringApplication.run() 方法。例如
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">String</span>[] <span class="org-variable-name">arg</span> = <span class="org-keyword">new</span> <span class="org-type">String</span>[1];
    arg[0] = <span class="org-string">"--spring.profiles.active=prod"</span>;
    SpringApplication.run(MyApplication.<span class="org-keyword">class</span>, arg);
}
</pre>
</div>
</div>
</section>

<section id="outline-container-org1b7f19a" class="outline-2">
<h2 id="org1b7f19a">SpringBoot 中配置文件的优先级</h2>
<div class="outline-text-2" id="text-org1b7f19a">
<p>
从上至下优先级越来越高。
同级别的路径中 properties 配置文件的优先级比 yml 配置文件的优先级高。
</p>

<ol class="org-ol">
<li>classpath 中的 application.yml</li>
<li>classpath 中的 config/application.yml</li>
<li>当前工作目录中的 application.yml</li>
<li>当前工作目录中的 config/application.yml</li>
</ol>

<p>
注意：当前工作目录是指执行 java 命令时所处的目录。
</p>
</div>
</section>

<section id="outline-container-org17409a4" class="outline-2">
<h2 id="org17409a4">SpringBoot 多环境配置</h2>
<div class="outline-text-2" id="text-org17409a4">
</div>
<div id="outline-container-org798d54f" class="outline-3">
<h3 id="org798d54f">在同一个 yml 配置文件中配置不同的环境</h3>
<div class="outline-text-3" id="text-org798d54f">
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">spring</span>:
  <span class="org-variable-name">profiles</span>:
    <span class="org-variable-name">active</span>: dev

<span class="org-comment">---</span>
<span class="org-variable-name">spring</span>:
  <span class="org-variable-name">profiles</span>: dev

<span class="org-variable-name">server</span>:
  <span class="org-variable-name">port</span>: 8081

<span class="org-comment">---</span>
<span class="org-variable-name">spring</span>:
  <span class="org-variable-name">profiles</span>: test

<span class="org-variable-name">server</span>:
  <span class="org-variable-name">port</span>: 8082

<span class="org-comment">---</span>
<span class="org-variable-name">spring</span>:
  <span class="org-variable-name">profiles</span>: prod

<span class="org-variable-name">server</span>:
  <span class="org-variable-name">port</span>: 8083
</pre>
</div>

<p>
可以看到配置文件中默认激活的是 <code>dev</code> 环境，
可以打包后执行 <code>java -jar my-application.jar --spring.profiles.active=prod</code> 指定激活的环境.
</p>

<p>
注意： <code>spring.profiles=dev</code> 被标记为已废弃的方式，
现在推荐使用 <code>spring.config.activete.on-profile=dev</code> 这种方式.
</p>
</div>
</div>

<div id="outline-container-org2734310" class="outline-3">
<h3 id="org2734310">使用不同的文件配置多个环境</h3>
<div class="outline-text-3" id="text-org2734310">
<ol class="org-ol">
<li><code>application.yml</code> 公共配置</li>
<li><code>application-dev.yml</code> 开发环境配置</li>
<li><code>application-test.yml</code> 测试环境配置</li>
<li><code>application-prod.yml</code> 生产环境配置</li>
</ol>
</div>
</div>

<div id="outline-container-org51d62cb" class="outline-3">
<h3 id="org51d62cb">使用 <code>spring.profiles.include</code> 包含其他配置文件</h3>
<div class="outline-text-3" id="text-org51d62cb">
<p>
比如，将数据库，缓存，消息队列等配置放置在不同的配置文件中，在主配置文件中使用 <code>include</code> 加载这些配置。
</p>

<p>
假设有如下配置文件:
</p>
<pre class="example" id="org86f8929">
application-db.yml
application-kafka.yml
application-redis.yml
</pre>

<p>
主配置文件中可以这样配置:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">spring</span>:
  <span class="org-variable-name">profiles</span>:
    <span class="org-variable-name">include</span>: db,kafka,redis
</pre>
</div>

<p>
启动应用后可以看到如下输出:
</p>
<pre class="example" id="org6f0e013">
The following 3 profiles are active: "db", "kafka", "redis"
</pre>

<p>
如果有相同的配置， 优先级顺序也是左边(db)优先级低， 右边(redis)优先级高。主配置文件中配置优先级是最低的。
</p>

<p>
注意： <code>include</code> 的配置文件是不包含文件名中 <code>application-</code> 前缀的。如果写错了，启动时也是不会报错的，可能不容易发现。
</p>
</div>
</div>

<div id="outline-container-orgc40d932" class="outline-3">
<h3 id="orgc40d932">使用 <code>spring.profiles.group</code> 对配置文件分组</h3>
<div class="outline-text-3" id="text-orgc40d932">
<p>
主配置文件中配置内容如下：
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">spring</span>:
  <span class="org-variable-name">profiles</span>:
    <span class="org-variable-name">active</span>: prod
    <span class="org-variable-name">group</span>:
      <span class="org-variable-name">dev</span>: db,redis
      <span class="org-variable-name">prod</span>: db,kafka
</pre>
</div>

<p>
启动时可以看到如下输出:
</p>
<pre class="example" id="orgdf710cf">
The following 3 profiles are active: "prod", "db", "kafka"
</pre>

<p>
同样，如果有相同配置时，由左至右优先级越来越高。
</p>
</div>
</div>
